In [1]:
import pandas as pd
import numpy as np

In [18]:
df = pd.read_csv("./nse5paisaScriptMaster.csv")

In [19]:
df.head()

,Exch,ExchType,Scripcode,Name,Series,Expiry,CpType,StrikeRate,WireCat,ISIN,FullName
0,N,D,49343,NIFTY 31 Mar 2022 CE 18000.00 ...,XX,2022-03-31 14:30:00,CE,18000.0,,NIFTY,NIFTY 31 Mar 2022 CE 18000.00
1,N,D,49344,NIFTY 31 Mar 2022 PE 18000.00 ...,XX,2022-03-31 14:30:00,PE,18000.0,,NIFTY,NIFTY 31 Mar 2022 PE 18000.00
2,N,D,49345,BANKNIFTY 30 Sep 2021 CE 36800.00 ...,XX,2021-09-30 14:30:00,CE,36800.0,,BANKNIFTY,BANKNIFTY 30 Sep 2021 CE 36800.00
3,N,D,49346,BANKNIFTY 30 Sep 2021 PE 36800.00 ...,XX,2021-09-30 14:30:00,PE,36800.0,,BANKNIFTY,BANKNIFTY 30 Sep 2021 PE 36800.00
4,N,D,49347,BANKNIFTY 30 Sep 2021 CE 36900.00 ...,XX,2021-09-30 14:30:00,CE,36900.0,,BANKNIFTY,BANKNIFTY 30 Sep 2021 CE 36900.00

In [20]:
df = df[(df['Exch']=='N') & (df['ExchType']=='C')]

In [21]:
df.reset_index(drop=True , inplace=True)

In [23]:
df['Name'] = df['Name'].str.strip()

In [24]:
df.head()

,Exch,ExchType,Scripcode,Name,Series,Expiry,CpType,StrikeRate,WireCat,ISIN,FullName
0,N,C,1,GOLDSTAR,SM,1980-01-01 00:00:00,XX,0.0,Z,INE405Y01013,GOLDSTAR POWER LIMITED
1,N,C,4,21STCENMGM,EQ,1980-01-01 00:00:00,XX,0.0,Z,INE253B01015,21ST CENTURY MGMT SERVICE
2,N,C,6,364D090921,TB,1980-01-01 00:00:00,XX,0.0,Z,IN002020Z238,GOI TBILL 364D-09/09/21
3,N,C,7,AARTIIND,EQ,1980-01-01 00:00:00,XX,0.0,B,INE769A01020,AARTI INDUSTRIES LTD
4,N,C,8,507PY23,SG,1980-01-01 00:00:00,XX,0.0,Z,IN3820200019,SDL PY 5.07% 2023

In [25]:
df.to_csv("./NSECashScripts.csv" , index=False)

In [17]:
df[df['Name']=="NIFTY"]

,Exch,ExchType,Scripcode,Name,Series,Expiry,CpType,StrikeRate,WireCat,ISIN,FullName
3760,N,C,999920000,NIFTY,EQ,1980-01-01 00:00:00,EQ,0.0,Z,NaN,NIFTY ...